Reports/ПрофильнаяОценкаКомпетенцийСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ПрофильнаяОценкаКомпетенцийСотрудников</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ОценкиОтветовОпросаПоКомпетенциям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОценкиОтветовОпросаПоКомпетенциям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияХарактеристик</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольЭксперта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиРеспондентаОценкиПерсонала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийЭксперта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОпросПоКомпетенциям</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОпросыПоКомпетенциям</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Эксперт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОценивающийЭксперт</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаПерсонала</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ОпросыПоКомпетенциям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОпросыПоКомпетенциям</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполненияЭкспертов</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособЗаполненияРеспондентовВОценке360</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииОценивающиеЭксперты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОткрытыеВопросы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулировкаРазделаОткрытыхВопросов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оцениваемые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеОпроса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НазначениеОпросов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОценивающиеЭкспертыЕдиныйНабор</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОценивающийЭксперт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОценивающийЭксперт</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольЭксперта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиРеспондентаОценкиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОценивающиеЭксперты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценивающийЭксперт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОценивающийЭксперт</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольЭксперта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиРеспондентаОценкиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОткрытыеВопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ПрофильнаяОценкаКомпетенцийСотрудников/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ЗарплатаКадрыОтчеты.ПередНачаломКомпоновкиРезультата(ЭтотОбъект);
	
	СтандартнаяОбработка = Ложь;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	ДокументРезультат.Очистить();
	
	СтруктураКомпоновки = НастройкиОтчета.Структура;
	Для Каждого ЭлементСтруктуры Из СтруктураКомпоновки Цикл
		Если ЭлементСтруктуры.Имя = "ГруппировкаСДиаграммой" Тогда
			ЗначениеПериода = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтандартныйПериод")).Значение;
			МаксимальныйБалл = МаксимальныйБаллЗаПериод(ЗначениеПериода.ДатаНачала, ЗначениеПериода.ДатаОкончания);
			Если МаксимальныйБалл > 0 Тогда
				ПараметрыВыводаДиаграммы = ЭлементСтруктуры.Структура[0].ПараметрыВывода;
				ПараметрТипДиаграммы = ПараметрыВыводаДиаграммы.Элементы.Найти("ТипДиаграммы");
				ОсьЗначений = ПараметрТипДиаграммы.ЗначенияВложенныхПараметров.Найти("ТипДиаграммы.ОсьЗначений");
				ОсьЗначений.Использование = Истина;
				ОсьЗначений.Значение.СпособОпределенияМаксимальногоЗначения = СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
				ОсьЗначений.Значение.МаксимальноеЗначение = МаксимальныйБалл;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	МакетКомпоновкиДанных = ЗарплатаКадрыОтчеты.МакетКомпоновкиДанных(СхемаКомпоновкиДанных,
		НастройкиОтчета, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.НачатьВывод();
	ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
	ВыводитсяДиаграмма = Ложь;
	Пока ЭлементРезультата <> Неопределено Цикл
		
		Если Не ВыводитсяДиаграмма Тогда
			ОписаниеМакета = МакетКомпоновкиДанных.Макеты.Найти(ЭлементРезультата.Макет);
			Если ОписаниеМакета <> Неопределено Тогда
				Если ТипЗнч(ОписаниеМакета.Макет) = Тип("МакетДиаграммыОбластиКомпоновкиДанных")
					И ОписаниеМакета.Макет.Оформление.Элементы[0].Значение = ТипДиаграммы.ГистограммаГоризонтальная Тогда
					ВыводитсяДиаграмма = Истина;
					НачалоДиаграммы = ДокументРезультат.ВысотаТаблицы;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
		
		Если ВыводитсяДиаграмма И ЭлементРезультата.ТипЭлемента = ТипЭлементаРезультатаКомпоновкиДанных.Конец Тогда
			КоличествоРисунков = ДокументРезультат.Рисунки.Количество();
			Если КоличествоРисунков > 0 Тогда
				Рисунок = ДокументРезультат.Рисунки[КоличествоРисунков - 1];
				Если Рисунок.Объект.КоличествоТочек < 4 Тогда
					КонецДиаграммы = ДокументРезультат.ВысотаТаблицы;
					Область = ДокументРезультат.Область(НачалоДиаграммы, , КонецДиаграммы);
					Область.АвтовысотаСтроки = Ложь;
					Область.ВысотаСтроки = 3;
				КонецЕсли;
				ВыводитсяДиаграмма = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
	КонецЦикла;
	ПроцессорВывода.ЗакончитьВывод();
	
	ЗарплатаКадрыОтчеты.ПриЗавершенииКомпоновкиРезультата(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьОтчет() Экспорт
	
	ЗарплатаКадрыОбщиеНаборыДанных.ВывестиВОтчетДополнительныеПоляПредставлений(ЭтотОбъект, ДополнительныеПоляПредставлений());
	
КонецПроцедуры

// Для общей формы "Форма отчета" подсистемы "Варианты отчетов".
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	Настройки.События.ПриОпределенииПараметровВыбора = Истина;
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("Опрос"));
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ОпросПрофильДолжности"));
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("СтандартныйПериод"));
	Настройки.ЗагрузитьНастройкиПриИзмененииПараметров = Параметры;
	
КонецПроцедуры

// Вызывается перед загрузкой новых настроек. Используется для изменения схемы компоновки.
//
Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	
	Если КлючСхемы <> "СхемаИнициализирована" Тогда
		
		ИнициализироватьОтчет();
		ОтчетыСервер.ПодключитьСхему(ЭтотОбъект, Контекст, СхемаКомпоновкиДанных, КлючСхемы);
		
		КлючСхемы = "СхемаИнициализирована";
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОтчетыПереопределяемый.ПриОпределенииПараметровВыбора.СвойстваНастройки
Процедура ПриОпределенииПараметровВыбора(Форма, СвойстваНастройки) Экспорт
	
	Если СвойстваНастройки.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица") Тогда
		ЗначениеПараметраОпрос = КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Опрос"));
		Если ЗначениеПараметраОпрос.Значение = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если Не ЗначениеПараметраОпрос.Использование Тогда
			Возврат;
		КонецЕсли;
		Если ЗначениеПараметраОпрос.Значение = Тип("СписокЗначений") Тогда
			ОпросыПоКомпетенциям = ЗначениеПараметраОпрос.Значение.ВыгрузитьЗначения();
		Иначе
			ОпросыПоКомпетенциям = Новый Массив;
			ОпросыПоКомпетенциям.Добавить(ЗначениеПараметраОпрос.Значение);
		КонецЕсли;
		СвойстваНастройки.ОграничиватьВыборУказаннымиЗначениями = Истина;
		СвойстваНастройки.ЗначенияДляВыбора.Очистить();
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОпросыПоКомпетенциямОцениваемые.ФизическоеЛицо КАК ФизическоеЛицо
			|ИЗ
			|	Справочник.ОпросыПоКомпетенциям.Оцениваемые КАК ОпросыПоКомпетенциямОцениваемые
			|ГДЕ
			|	ОпросыПоКомпетенциямОцениваемые.Ссылка В (&Опрос)";
		СвойстваНастройки.ЗапросЗначенийВыбора.Текст = ТекстЗапроса;
		СвойстваНастройки.ЗапросЗначенийВыбора.Параметры.Вставить("Опрос", ОпросыПоКомпетенциям);
	ИначеЕсли СвойстваНастройки.ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ОпросыПоКомпетенциям") Тогда
		ЗначениеПараметраПрофиль = КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОпросПрофильДолжности"));
		ПрофильДолжности = ЗначениеПараметраПрофиль.Значение;
		ПрофильИспользуется = ЗначениеПараметраПрофиль.Использование;
		Если Не ПрофильИспользуется Тогда
			Возврат;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ПрофильДолжности) Тогда
			Возврат;
		КонецЕсли;
		ЗначениеПериода = КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтандартныйПериод")).Значение;
		СвойстваНастройки.ОграничиватьВыборУказаннымиЗначениями = Истина;
		СвойстваНастройки.ЗначенияДляВыбора.Очистить();
		СвойстваНастройки.ЗапросЗначенийВыбора.Текст = Справочники.ОпросыПоКомпетенциям.ТекстЗапросаОпросыПоПрофилю();
		СвойстваНастройки.ЗапросЗначенийВыбора.Параметры.Вставить("ПрофильДолжности", ПрофильДолжности);
		СвойстваНастройки.ЗапросЗначенийВыбора.Параметры.Вставить("ДатаНачала", ЗначениеПериода.ДатаНачала);
		СвойстваНастройки.ЗапросЗначенийВыбора.Параметры.Вставить("ДатаОкончания", ЗначениеПериода.ДатаОкончания);
	КонецЕсли;
		
КонецПроцедуры

Функция ДополнительныеПоляПредставлений() Экспорт
	
	ДополнительныеПоляКадровыхДанныхСотрудников = КадровыйУчет.ПоляПредставленийКадровыхДанныхСотрудников();
	
	ДополнительныеПоля = Новый Структура;
	ДополнительныеПоля.Вставить("Представления_КадровыеДанныеСотрудников", ДополнительныеПоляКадровыхДанныхСотрудников);
	
	Возврат ДополнительныеПоля;
	
КонецФункции

Функция МаксимальныйБаллЗаПериод(ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала.ШкалаЗначений КАК ХарактеристикаПерсоналаШкалаЗначений
		|ПОМЕСТИТЬ ВТШкалыЗначений
		|ИЗ
		|	РегистрСведений.ОценкиОтветовОпросаПоКомпетенциям КАК ОценкиОтветовОпросаПоКомпетенциям
		|ГДЕ
		|	ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ДатаНачала > &ДатаНачала
		|	И ОценкиОтветовОпросаПоКомпетенциям.ОпросПоКомпетенциям.ДатаОкончания < &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	ОценкиОтветовОпросаПоКомпетенциям.ХарактеристикаПерсонала.ШкалаЗначений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЕСТЬNULL(ЗначенияХарактеристик.ЧисловоеЗначение, 0) КАК Балл
		|ИЗ
		|	ВТШкалыЗначений КАК ВТШкалыЗначений
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияХарактеристик КАК ЗначенияХарактеристик
		|		ПО ВТШкалыЗначений.ХарактеристикаПерсоналаШкалаЗначений = ЗначенияХарактеристик.Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Балл УБЫВ";
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() > 0 Тогда
		Возврат Результат[0].Балл;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
